{
    "version": "https://jsonfeed.org/version/1",
    "title": "I Write Stuff",
    "description": "",
    "home_page_url": "https://www.elmike.me",
    "feed_url": "https://www.elmike.me/feed.json",
    "user_comment": "",
    "author": {
        "name": "elmikewalsh"
    },
    "items": [
        {
            "id": "https://www.elmike.me/enough/",
            "url": "https://www.elmike.me/enough/",
            "title": "Enough",
            "content_html": "<p>Quentin Tarantino recently remarked that he plans to make 10 movies, and that’s it. (note: in context, he did indicate that he would be fine doing something later on despite having done 10 movies, so it’s not a set-in-stone number). Mentioned wanting to go out at the top of his game.  Similar to some, but not all, athletes.  The same applies to everything; our “mere mortal” projects. Our jobs. Our ambitions. Our desire to make more, have more, obtain more, visit more, watch more, see more.</p>\n<p><strong>At what point is it enough?</strong></p>\n<p>Enough means the necessary to meet a need or desire. So once you reach that point, everything beyond that is extra. Unnecessary. Wasteful, even.</p>\n<p><strong>Is the glass half full or half empty?</strong>  <em>(Is that even the correct question?)</em></p>\n<p>There is a strong minimalism trend in a number of circles. You can find excesses in minimalism as well, as many try to do away with everything except the bare spartan essentials of life. In the design world, minimalism appears to mean “Only use black and white please. Hopefully only text.”.  But in some cases, enough means more than black and white.</p>\n<p>There is an old adage to “take everything in moderation”. That is a fine way to avoid excesses, but then again, taking “everything in moderation” is in itself excessive. More than “enough” (so go crazy every once in a while). </p>\n<p>It’s a good idea to stop every now and again to ask yourself, “What is enough?”  If not, you may never know when you’ve arrived.</p>\n<p><strong>Photo Used: </strong><a href=\"https://www.shopify.com/stock-photos/photos/red-wine-in-kitchen\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.shopify.com/stock-photos/photos/red-wine-in-kitchen</a></p>",
            "image": "https://www.elmike.me/media/posts/33/enough-2.webp",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Life &amp; Stuff",
                   "All Articles",
                   "2024"
            ],
            "date_published": "2024-01-03T18:34:04-03:00",
            "date_modified": "2024-01-24T09:58:56-03:00"
        },
        {
            "id": "https://www.elmike.me/simply-seasonal/",
            "url": "https://www.elmike.me/simply-seasonal/",
            "title": "Simply Seasonal",
            "content_html": "<p>According to the Gregorian calendar, another year (2023) is coming to a close. That time of year where many people across the world enter the yearly commercialist furor and shop, shop, shop, eat, eat, eat and drink, drink, drink.</p>\n<ul>\n<li>Let’s get XYZ gifts for XYZ people. Person X is surely going to give us a gift, so we have to have one to gift back to Person X.</li>\n<li>“The food has to be perfect.”</li>\n<li>“The table has to be perfect.”</li>\n<li>“Everything has to be perfect. Just like last year. Just like next year.”</li>\n<li>“The tree has to be bigger than last year. More tree. More lights!”</li>\n</ul>\n<p>Oh my goodness, I have a headache and am stressed just writing this.  Pull the handbrake. Stop. Breathe. Relax. Step away from the stress machine and <strong>no. one. will. get. hurt.</strong></p>\n<p>Take the time to stop, relax, look around, and enjoy. Let it go. Keep it simple. Go watch <a href=\"https://tv.apple.com/us/movie/a-charlie-brown-christmas/umc.cmc.mbxalimrwrtq72wj4h601pyf\" target=\"_blank\" rel=\"noopener noreferrer\">A Charlie Brown Christmas</a>.</p>\n<p>Enjoy the holiday and live to tell about it.</p>\n<p><strong>Photo Used:</strong> Our Christmas tree. Simple. Handmade. Reusable.</p>",
            "image": "https://www.elmike.me/media/posts/32/our-tree.jpg",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Life &amp; Stuff",
                   "All Articles",
                   "2023"
            ],
            "date_published": "2023-12-22T09:28:12-03:00",
            "date_modified": "2024-01-24T09:59:05-03:00"
        },
        {
            "id": "https://www.elmike.me/4-ways-to-fuck-up-a-simple-yesno-question/",
            "url": "https://www.elmike.me/4-ways-to-fuck-up-a-simple-yesno-question/",
            "title": "4 Ways To Fuck Up A Simple Yes / No Question",
            "content_html": "<p>On Sunday, December 17, Chile will (again) go to the polls to vote on the new constitution proposal. In very very general political terms, while the first proposal a couple years back was seen as “leftist”, the new one has been prepared by a predominantly right-wing group. It is a simple vote: Do you approve of the new constitution?  Yes or No. Simple question. How hard could it be?</p>\n<p>It’s pretty easy to fuck it up, if you think about it (which, unfortunately, I have). So, here are 4 ways to fuck up a simple yes/no question:</p>\n<ol>\n<li><strong>Answer Unprepared:</strong> To vote on a new constitution, you need to read it. You can argue all you want about how it’s long, not everyone has the education level to understand it, etc. If you are reading this, you can read the constitution. Is it long?  Hell, yeah. Over 170 pages.  Is it really interesting?  Not so much.  But considering it is an overreaching document that serves as a sort of national guide for maybe at least 100 years, it might be important.  And considering how much time we spend on phones, on Netflix, on stuff that really isn’t essential to the day-to-day, it’s more irresponsibility or laziness that we don’t bother.  Even if you don’t read it all, at least read some parts. Maybe the ones you feel are the most important.</li>\n<li><strong>Copy Someone Else’s Answer:</strong> Love this one. People all the time complain about how everyone is only interested in themselves and their own well-being; government is only interested in keeping power. But when it comes time to vote yes/no on a constitution, we open it, see how many pages it is, and resort to…. The opinions of other and/or the news. It hurts to think for myself, please think for me. My favorite is when people bitch and moan about how politicians are corrupt, then check to see what their favorite political party is going to vote. Lovely.</li>\n<li><strong>Vote Based On Who Is President:</strong> This one is absurd. A constitution (democratically prepared) is larger than one (or several) administrations. Some people will vote in favor (or against) on Sunday based solely on who is currently president. The current president, by the way, has nothing to do with the new document. It’s a bit like saying, “The football team I hate uses blue uniforms, so I hate football.”</li>\n<li><strong>Don’t Answer The Question:</strong> Annulling your vote for president or senator or what have you is one thing (still think those annulled votes should have some consequence). But this is a document that will be around for a while (if approved) so good to have an opinion. And also, not voting will expose you to a fine.</li>\n</ol>\n<p>Well, we will have to see how this turns out on the weekend. I’m sure there are many other ways to fuck up a simple yes/no question, but you need to start somewhere. And now you know.</p>\n<p><strong>Photo used: </strong><a href=\"https://unsplash.com/photos/a-person-is-casting-a-vote-into-a-box-T9CXBZLUvic\" target=\"_blank\" rel=\"noopener noreferrer\">https://unsplash.com/photos/a-person-is-casting-a-vote-into-a-box-T9CXBZLUvic</a></p>",
            "image": "https://www.elmike.me/media/posts/30/4-ways-to.webp",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Politics",
                   "Life &amp; Stuff",
                   "Humor",
                   "All Articles",
                   "2023"
            ],
            "date_published": "2023-12-13T13:42:41-03:00",
            "date_modified": "2024-01-24T09:59:16-03:00"
        },
        {
            "id": "https://www.elmike.me/everything-is-for-sale-dignity-not-included/",
            "url": "https://www.elmike.me/everything-is-for-sale-dignity-not-included/",
            "title": "Everything Is For Sale (Dignity Not Included)",
            "content_html": "<p>I remember a past time, a golden time, when this interconnected space called the internet was a different place. It was a place to show who you were, unashamedly. GeoCities and MySpace existed (don’t miss them), Google did not. It was a place to build spaces and pages with primary colors, and behold the hideous ugliness that resulted and say, “I. Made. That.”  And it was created, for no other reason than to make something and maybe – just maybe – someone else would find it.</p>\n<h3>That was then, this is now:</h3>\n<p>The internet has largely transformed itself into the digital equivalent of a mall, where everyone wants to sell you something, or get you to subscribe to the latest trend.  All in all, it’s all the same as the next website, except “it’s our special take on it; subscribe to / buy our XYZ, not the other one”. Every website seems to have a pop-up window, and some try to block what you are looking for. Others are so full of advertisements and banners that you have to search to find what you were really looking for.</p>\n<p>We got smart and installed ad-blockers. The websites, desperate for hits and money, punched back, sometimes forcing us to “disable” the ad blocker, as if what we were doing was….bad. (quick tip: love Safari – when the pop-up does not give you the option to close it, just hit the Reader Mode and it all goes away).   :)</p>\n<p>When we go home (or wherever we live) we close the windows, turn off the lights, and leave the world outside. We then connect to our social media to upload photos of every single waking moment of our life (stopping to actually live that life, in order to better document it). What we are wearing (or not). What we are doing. Where we are doing it. With whom. It’s kinda the equivalent of living in a glass house, taking off all your clothes, taking out a megaphone and announcing to the world that the party is at your place.</p>\n<p><strong>Ewwwww.</strong></p>\n<p>I guess no one will really stop for a moment to actually think about what (and why) we do what we do when we connect. We’re too busy turning off our brains to do what we always do.</p>\n<p>So many people are worried that AI will soon be smarter than humans and we should stop developing that technology. I’d say that humans are in such a rush to stupidify themselves that IA won’t have to overtake us at all – we’ll just dumb ourselves down until AI passes us by naturally.</p>\n<p><strong>Photo used:</strong> <a href=\"https://pixabay.com/photos/christmas-shoping-center-store-1931054/\" target=\"_blank\" rel=\"noopener noreferrer\">https://pixabay.com/photos/christmas-shoping-center-store-1931054/</a></p>",
            "image": "https://www.elmike.me/media/posts/28/bw-everything-is-for-sale.webp",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Life &amp; Stuff",
                   "All Articles",
                   "2023"
            ],
            "date_published": "2023-12-08T17:44:07-03:00",
            "date_modified": "2024-01-24T09:59:28-03:00"
        },
        {
            "id": "https://www.elmike.me/defending-your-cybercastle-digital-art-of-war/",
            "url": "https://www.elmike.me/defending-your-cybercastle-digital-art-of-war/",
            "title": "Defending Your Cybercastle: Digital Art of War",
            "content_html": "<p>In today's world, our virtual existence is like a fortress. Just like castles required fortifications for protection, so does your online presence. It may sound daunting, but don't worry, we've poked around the sage advice from the legendary Sun Tzu, master strategist, to help you strengthen your digital defenses without feeling like you're preparing for war.</p>\n<h3>Know Your Board Game</h3>\n<p>First and foremost, let's look at the importance of knowing the playing field. As Sun Tzu famously said, </p>\n<blockquote>\n<p><strong><em>If you know the enemy and know yourself, you need not fear the result of a hundred battles.</em></strong></p>\n</blockquote>\n<p>In the digital realm as understanding your various platforms, being aware of where your sensitive information is stored, and identifying any potential vulnerabilities in your online setup. Where have you set up accounts, what information have you provided, how strong is your password, who has access, etc.</p>\n<p>Defense is not the only factor at play here - being a sly li’l devil is equally important (in a positive sense, of course…usually…). Sun Tzu valued deceit, and the same principle applies in this situation. Be on your guard against deceptive emails attempting to extract your confidential information or entice you to click on dubious links. Adaptability is also crucial. The digital sphere is constantly evolving, so your defenses must evolve as well. Stay ahead by updating security settings, choosing strong passwords (please refrain from 'password123'), installing and using a password manager (<a href=\"https://bitwarden.com\" target=\"_blank\" rel=\"noopener noreferrer\">Bitwarden</a> and <a href=\"https://proton.me/pass\" target=\"_blank\" rel=\"noopener noreferrer\">Proton Pass</a> are good), and implementing two-factor authentication for added security.</p>\n<h3>Ninja Up!</h3>\n<p>Don't forget, safeguarding your data is only one piece of the puzzle; safeguarding your identity is just as crucial. Your digital persona warrants just as much caution and protection as your physical self. By delving into Sun Tzu's strategies, you're equipping yourself with the skills of a ninja - swift, elusive to threats, and fortified against any breaches (and ninjas are super cool, of course).</p>\n<p>Armed with timeless wisdom and modern savvy, you'll be able to maneuver through the online realm like a seasoned pro, fortifying your virtual fortress against cyber intruders. It's like becoming your own personal cybersecurity hero without needing a superhero cape, and you can return to wearing your underwear under your pants (cough, cough, Superman, cough).</p>\n<hr>\n<p><strong>Photo used:</strong> <a href=\"https://pixabay.com/photos/terracotta-army-china-xian-soldier-1865006/\" target=\"_blank\" rel=\"noopener noreferrer\">https://pixabay.com/photos/terracotta-army-china-xian-soldier-1865006/</a></p>",
            "image": "https://www.elmike.me/media/posts/25/art-of-war-series.webp",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Life &amp; Stuff",
                   "Digital Art of War",
                   "All Articles",
                   "2023"
            ],
            "date_published": "2023-11-28T16:58:50-03:00",
            "date_modified": "2023-12-04T17:29:57-03:00"
        },
        {
            "id": "https://www.elmike.me/over-the-mountains/",
            "url": "https://www.elmike.me/over-the-mountains/",
            "title": "Over The Mountains",
            "content_html": "<p>Just a quick post to share a few photos from a trip across the mountains to a couple of towns in Argentina. Fun times (and chocolate) were had by all. :)</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_0993.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_0993-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1154.webp\" data-size=\"1125x2000\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1154-thumbnail.webp\" alt=\"\" width=\"720\" height=\"1280\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1397.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1397-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1404.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1404-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1148.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1148-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1399.webp\" data-size=\"1125x2000\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1399-thumbnail.webp\" alt=\"\" width=\"720\" height=\"1280\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1421.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1421-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1406.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1406-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1357.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1357-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1371.webp\" data-size=\"2000x1125\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1371-thumbnail.webp\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://www.elmike.me/media/posts/26/gallery/IMG_1373.webp\" data-size=\"1125x2000\"><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/26/gallery/IMG_1373-thumbnail.webp\" alt=\"\" width=\"720\" height=\"1280\"></a></figure>\n</div></div>\n<p class=\"align-center\"><em>San Martin de los Andes and Bariloche, Argentina.</em></p>",
            "image": "https://www.elmike.me/media/posts/26/photos-tag-image.webp",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Photos",
                   "All Articles",
                   "2023"
            ],
            "date_published": "2023-11-25T08:39:00-03:00",
            "date_modified": "2023-12-04T17:29:39-03:00"
        },
        {
            "id": "https://www.elmike.me/privacy-a-primer/",
            "url": "https://www.elmike.me/privacy-a-primer/",
            "title": "Privacy: A Primer",
            "content_html": "<p>Privacy is a hot topic in 2023. A concern for some, a buzzword for others. Should I care? What can I do? Is it too late? Why bother?</p>\n<p>I’d love to say this is your one-stop shop for all the answers, but who am I but one set of hands typing? (Disclaimer: In 2023, this website uses ancient technology – I am a human writing this article from scratch; no Artificial Intelligence added).</p>\n<p><strong>But some musings on privacy, for what they may be worth:</strong></p>\n<ol>\n<li>Privacy is one of those things that you don’t realize you have (or are losing) until you start to lose it (or no longer have it). Then you value it. And it is by that time too difficult to get it back.</li>\n<li>A completely different topic (Artificial Intelligence) is in large part our willingness to have signed up for and used online storage, free online photos (Google Photos, for example) and any other service offering too-good-to-be-free storage and functionality. Or is it just a coincidence that many of these “free” services used people as the product and then turned to paid plans right before the start of the big AI boom? Who cares about privacy or what can happen – just sign me up for my free photo storage!</li>\n<li>Many consider privacy “too difficult” a topic, requiring work and effort to attend to, and will definitely be interested “later”. I imagine living in a glass house, walking around naked all day, unconcerned that anyone passing by can shoot photos and videos of you now, because later down the road you will invest in curtains and that will just solve the entire problem then and there.</li>\n</ol>\n<p>So what can be done about privacy (online, at least)? Well, this does not at all aim to be a comprehensive primer on protecting yourself online. Just a small list of ideas and possible solutions / services. I’m not affiliated with any of them, and I get nothing by you clicking any links here.</p>\n<ul>\n<li><strong>Email:</strong> Well, it seems like everyone has their Gmail. Sign up, free space. Free photos. Free collaboration. Free, free, free. Until it isn’t. Sign in to any website easy with your Gmail. They can’t read your email. That’s what they say. And you can simply use Google to search for evidence of that. Remember, they are a business, and they have a bottom line. You might consider more private email options such as <a href=\"https://proton.me/mail\" target=\"_blank\" rel=\"noopener noreferrer\">ProtonMail</a>, <a href=\"https://skiff.com/mail\" target=\"_blank\" rel=\"noopener noreferrer\">Skiff Mail</a> or <a href=\"https://postale.io/\" target=\"_blank\" rel=\"noopener noreferrer\">postale.io</a>. Email (or any service) is only as private as the laws of the country in which the service resides, and it is best to consider the allies / strategic partners of foreign countries (consider searching for things like “Five Eyes” and other related terms. Not on Google. Or in their browser. Go for something private.</li>\n<li><strong>Search:</strong> If you type it into a Google search engine, the world knows it. And don’t fool yourself into thinking that “Private / Incognito” means no one knows. Consider using a search engine that does not track you and your every keystroke, such as <a href=\"https://duckduckgo.com\" target=\"_blank\" rel=\"noopener noreferrer\">DuckDuckGo</a> or <a href=\"https://www.startpage.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Startpage</a> (which uses Google results but strips the tracking info).</li>\n<li><strong>Photos:</strong> Google makes money selling advertising. Your information. So the more info they collect on you, the more money they can make. Use any other service. Am I saying that OneDrive or iCloud are private? Hell, no. Does Apple (currently) have a business model of selling advertising to anyone in the universe? No.  So, while it might not be an ideal solution, consider that convenience has a price.</li>\n</ul>\n<p>Most websites will also use Google Analytics to track you, because companies / sites are obsessed with seeing how much traffic they receive.  This website, by the way, has no tracking or analytics installed. I don’t care. There is a method of contact indicated on this website; if you are interested in it, you will find it easily enough.</p>\n<p>Well, those are the musings of the moment. Hope it is of some help to someone!</p>\n<hr>\n<p><strong>Photo used:</strong> <a href=\"https://unsplash.com/es/fotos/camaras-de-seguridad-de-varios-colores-LfaN1gswV5c\" target=\"_blank\" rel=\"noopener noreferrer\">https://unsplash.com/es/fotos/camaras-de-seguridad-de-varios-colores-LfaN1gswV5c</a></p>",
            "image": "https://www.elmike.me/media/posts/24/privacy.webp",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Technology",
                   "Life &amp; Stuff",
                   "All Articles",
                   "2023"
            ],
            "date_published": "2023-11-21T09:25:53-03:00",
            "date_modified": "2023-12-04T17:30:05-03:00"
        },
        {
            "id": "https://www.elmike.me/not-my-faultapp-default/",
            "url": "https://www.elmike.me/not-my-faultapp-default/",
            "title": "Not My Fault...App Default",
            "content_html": "<p>This little list appears to be making the rounds – I found it <a href=\"https://manuelmoreale.com/app-defaults\" target=\"_blank\" rel=\"noopener noreferrer\">here</a> at <a title=\"https://manuelmoreale.com/app-defaults\" target=\"_blank\" rel=\"noopener noreferrer\">Manuel Moreale</a>’s website, and looks like he stumbled upon it from another site.  Indeed it does look fun, so sharing my version here:</p>\n<ul>\n<li><strong>Mail Client:</strong> Apple Mail</li>\n<li><strong>Mail Server:</strong> Bouncing between iCloud and postale.io</li>\n<li><strong>Notes:</strong> Apple Notes</li>\n<li><strong>To-Do:</strong> Apple Notes</li>\n<li><strong>Photo Shooting:</strong> Apple Camera</li>\n<li><strong>Photo Management:</strong> Apple Photos</li>\n<li><strong>Calendar:</strong> Apple Calendar</li>\n<li><strong>Cloud File Storage:</strong> iCloud &amp; OneDrive</li>\n<li><strong>RSS:</strong> <a href=\"https://netnewswire.com\" target=\"_blank\" rel=\"noopener noreferrer\">NetNewsWire</a></li>\n<li><strong>Contacts:</strong> Apple Contacts</li>\n<li><strong>Browser:</strong> Safari for home/work; Firefox for work</li>\n<li><strong>Chat:</strong> WhatsApp (unfortunately), Apple Messages</li>\n<li><strong>Bookmarks:</strong> None</li>\n<li><strong>Word Processing:</strong> Microsoft Word</li>\n<li><strong>Spreadsheets:</strong> Excel, Numbers</li>\n<li><strong>Presentations:</strong> No, no, no, no</li>\n<li><strong>News:</strong> Try to avoid, but in-browser</li>\n<li><strong>Music:</strong> <a href=\"https://www.spotify.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Spotify</a> (I really tried, Apple Music, but just didn’t work)</li>\n<li><strong>Password Management:</strong> BitWarden</li>\n<li><strong>Blog / Website:</strong> <a href=\"https://getpublii.com\" target=\"_blank\" rel=\"noopener noreferrer\">Publii</a></li>\n<li><strong>Code Editor:</strong> Sublime Text</li>\n<li><strong>Screenshots:</strong> <a href=\"https://dropshare.app\" target=\"_blank\" rel=\"noopener noreferrer\">Dropshare</a></li>\n</ul>\n<hr>\n<p><strong>Photo used:</strong> <a href=\"https://pixabay.com/illustrations/apps-social-media-network-internet-426559/\" target=\"_blank\" rel=\"noopener noreferrer\">https://pixabay.com/illustrations/apps-social-media-network-internet-426559/</a></p>",
            "image": "https://www.elmike.me/media/posts/23/app-defaults.webp",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Technology",
                   "All Articles",
                   "2023"
            ],
            "date_published": "2023-11-17T17:44:29-03:00",
            "date_modified": "2023-12-22T07:43:40-03:00"
        },
        {
            "id": "https://www.elmike.me/ode-to-whisky/",
            "url": "https://www.elmike.me/ode-to-whisky/",
            "title": "Ode to Whisky",
            "content_html": "<p>Some reflexions on that magical liquid called whiskey</p>\n<blockquote>\n<p>Too much of anything is bad, but too much good whiskey is barely enough. - Mark Twain</p>\n</blockquote>\n<blockquote>\n<p>I like my whisky old and my women young. - Errol Flynn</p>\n</blockquote>\n<blockquote>\n<p>Whisky is liquid sunshine. - George Bernard Shaw</p>\n</blockquote>\n<blockquote>\n<p>Always carry a flagon of whiskey in case of snakebite and furthermore always carry a small snake. - W. C. Fields</p>\n</blockquote>\n<blockquote>\n<p>My God, so much I like to drink Scotch that sometimes I think my name is Igor Stra-whiskey! - Igor Stravinsky</p>\n</blockquote>",
            "image": "https://www.elmike.me/media/posts/20/whiskey2.jpg",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Humor",
                   "All Articles",
                   "2019"
            ],
            "date_published": "2019-09-07T17:58:42-04:00",
            "date_modified": "2023-12-04T17:32:34-03:00"
        },
        {
            "id": "https://www.elmike.me/the-last-of-the-mujicans/",
            "url": "https://www.elmike.me/the-last-of-the-mujicans/",
            "title": "The Last of the Mujicans",
            "content_html": "<h3>The honest and consistent politician isn’t a unicorn — I think I just saw one over there…</h3>\n<p><strong>My special guest</strong></p>\n<p>An undeterminable number of days ago, I had a conversation with my wife. Out of nowhere, she asked me:</p>\n<ul>\n<li>“If you could invite any one person to dine with you, who would you invite?”</li>\n<li>I thought about the query for a short time and responded:</li>\n<li>“The ex-president of Uruguay, José “Pepe” Mujica.”</li>\n<li>“Oh? And why him?”</li>\n<li>“Well, in this world where all politicians appear to serve only themselves instead of the people, I feel that he could be one of the only honest and upright politicians remaining.”</li>\n<li>“Ok, I’ll set the table for two and a unicorn. By the way, Mike, what do unicorns eat anyways?” she probably thought.</li>\n</ul>\n<p id=\"d763\" class=\"ho hp dg oz hq b hr nk ht nl nm nn no np nq nr ib\" data-selectable-paragraph=\"\"></p>\n<hr>\n<figure class=\"post__image post__image\" ><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/16/1.jpeg\" alt=\"\" width=\"1000\" height=\"562\" sizes=\"100vw\" srcset=\"https://www.elmike.me/media/posts/16/responsive/1-xs.webp 300w ,https://www.elmike.me/media/posts/16/responsive/1-sm.webp 480w ,https://www.elmike.me/media/posts/16/responsive/1-md.webp 768w ,https://www.elmike.me/media/posts/16/responsive/1-lg.webp 1024w ,https://www.elmike.me/media/posts/16/responsive/1-xl.webp 1360w ,https://www.elmike.me/media/posts/16/responsive/1-2xl.webp 1600w\">\n<figcaption ><strong class=\"bs oy\">Image Credits: </strong>El Municipio, <a href=\"http://www.elmunicipio.com.do/index.php/america-latina/3762-las-42-frases-de-pepe-mujica-el-presidente-mas-querido\" class=\"bc co ic id ie if\" target=\"_blank\" rel=\"noopener noreferrer\">http://www.elmunicipio.com.do/index.php/america-latina/3762-las-42-frases-de-pepe-mujica-el-presidente-mas-querido</a></figcaption>\n</figure>\n<h3>The Last Hero</h3>\n<p>The filmmaker <a href=\"https://en.wikipedia.org/wiki/Emir_Kusturica\">Emir Kusturica</a> is working on a documentary about the life of the expresident of Uruguay called “The Last Hero” (El último héroe). But, why is the old ex-president of a country that is really, really tiny so….famous?</p>\n<p>Unfortunately, for many people, Mujica is most famous for his controversial legalization of marijuana. But what really got my attention, more than the initiative, and even more than the reasons for enacting it, was the way in which he presented it:</p>\n<blockquote>\n<p>This is an experiment. And just like any experiment, there are naturally risks involved and we have to have the intelligence to know that if this gets too big and becomes out-of-control, we can take a step back. We don’t have to become fanatical.” (Source: La Nación, translation mine)</p>\n</blockquote>\n<p>When was the last time a politician, in any country, spoke so candidly and said quite openly that something was unsure, and it was important to try it out and not be afraid to make mistakes?</p>\n<p>Can you say “<em><strong>never</strong></em>”?</p>\n<hr>\n<h3>The “Alternative Facts” New World</h3>\n<p>One of the first linguistic “gifts” that the Trump administration gave us was the now-famous “alternative facts” costume with which we can now dress up our lies and parade them around as if it were Halloween.</p>\n<p>In case you have been living under a rock somewhere, (as if Uruguay wasn’t “living under a rock somewhere”) an advisor to the now-President Trump, <a href=\"https://es.wikipedia.org/wiki/Kellyanne_Conway\">Kellyanne Conway</a>, was defending the Press Secretary, who was accused of inaccuracies when explaining the attendance of the president’s inauguration, and made it clear that the Press Secretary was not lying, but rather, offering alternative facts.</p>\n<p>Really, now….what is the alternative to a fact?</p>\n<p>And what does Mujica have to say about facts and lies?</p>\n<blockquote>\n<p>“I want to know the truth, but I don’t believe a damn in justice.” (Source: <a href=\"http://www.emol.com/noticias/magazine/2015/05/04/715320/mujica-en-filba.html\">Emol.com</a>, translation mine)</p>\n</blockquote>\n<hr>\n<figure class=\"post__image post__image\" ><img loading=\"lazy\" src=\"https://www.elmike.me/media/posts/16/2.jpeg\" alt=\"\" width=\"1000\" height=\"562\" sizes=\"100vw\" srcset=\"https://www.elmike.me/media/posts/16/responsive/2-xs.webp 300w ,https://www.elmike.me/media/posts/16/responsive/2-sm.webp 480w ,https://www.elmike.me/media/posts/16/responsive/2-md.webp 768w ,https://www.elmike.me/media/posts/16/responsive/2-lg.webp 1024w ,https://www.elmike.me/media/posts/16/responsive/2-xl.webp 1360w ,https://www.elmike.me/media/posts/16/responsive/2-2xl.webp 1600w\">\n<figcaption ><strong class=\"bs oy\">Image Credits: </strong>NTN24, <a href=\"http://www.ntn24.com/noticia/pepe-mujica-dice-adios-a-almagro-por-la-carta-que-envio-al-cne-sobre-situacion-de-venezuela-78294\" class=\"bc co ic id ie if\" target=\"_blank\" rel=\"noopener noreferrer\">http://www.ntn24.com/noticia/pepe-mujica-dice-adios-a-almagro-por-la-carta-que-envio-al-cne-sobre-situacion-de-venezuela-78294</a></figcaption>\n</figure>\n<section class=\"gc gd ge gf gg\">\n<div class=\"r mp p q l m\"><hr>\n<h3>Bigger is better, but…we’re talking about egos here</h3>\n<p>The simple life philosophy that the “world’s poorest president” embraces draws a stark contrast with the new, inflated, larger-than-life ego at the helm of the United States. Let’s take a look at the declarations of each one and then you, dear reader, can try to guess who said which:</p>\n<blockquote>\n<p>“I might be mistaken, because I often am, but I call it as I see it. (Source: <a href=\"https://www.publimetro.cl/cl/mundo/2014/03/14/42-frases-jose-pepe-mujica-presidente-mas-querido.html\">Publimetro</a>, translation mine)</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>“Show me someone without an ego, and I’ll show you a loser…” (Source: <a href=\"https://twitter.com/realdonaldtrump/status/409593552314712064\">Twitter</a>)</p>\n</blockquote>\n<p>Gosh, it certainly is a real head-scratcher, isn’t it?</p>\n</div>\n</section>\n<hr class=\"pm fq kx pn po lh pp pq pr ps pt\">\n<section class=\"gc gd ge gf gg\">\n<div class=\"r mp p q l m\">\n<h3>Two old guys cut from different cloth</h3>\n<p>While one old feller takes control of a nation with a crazy, frenetic energy, desperate to put his personal name and style in the history books, spearheading a new controversy every day, the other has finished his term. Despite his declarations of not wanting to run for reelection, he continues to serve his country as a Senator. He is content with what he has and not what he is lacks; he tends to his garden and trucks around his tiny nation in an old (1987) Volkswagen Beetle.</p>\n<p>So, in this acrid environment, full of controversy, scandal and uncertainty, it is necessary, I think, to pause, take a step back and see things — life included — from a different angle.</p>\n<p>The world is not a place always filled with flowers and optimism, but neither is it perpetually the inverse. And politicians, like all of us, are only human. We don’t — shouldn’t — depend on them to “save the world” because it is tasked to each of us to “save our world”, wherever it is and however small it may be.</p>\n<p>Perhaps there is no better way to part ways than with this gem of a quote from the Last of the Mujicans:</p>\n<blockquote>\n<p>“Despite it all, I believe that the human being that is able not only to improve the world, but also to improve himself. Perhaps I’m mistaken, but let me die with utopias” (Source: <a href=\"http://www.emol.com/noticias/magazine/2015/05/04/715320/mujica-en-filba.html\">Emol</a>, translation mine)</p>\n</blockquote>\n<p>Now go out and make the world a better place, although only one drop, because life won’t do it alone.</p>\n</div>\n</section>",
            "image": "https://www.elmike.me/media/posts/16/cover.jpeg",
            "author": {
                "name": "elmikewalsh"
            },
            "tags": [
                   "Politics",
                   "All Articles",
                   "2017"
            ],
            "date_published": "2017-01-30T17:53:00-03:00",
            "date_modified": "2023-12-04T17:40:53-03:00"
        }
    ]
}
